# # 4. Дан список, содержащий искажённые данные с должностями и именами сотрудников:
# # ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА','токарь высшего разряда нИКОЛАй', 'директор аэлита']
# # Известно, что имя сотрудника всегда в конце строки. Сформировать из этих имён и вывести на
# # экран фразы вида: 'Привет, Игорь!' Подумать, как получить имена сотрудников из элементов
# # списка, как привести их к корректному виду. Можно ли при этом не создавать новый список?


# порядок таков : беру индекс каждого элемента из списка и разбиваю по индексу на 4 строки
# затем из них делаю подстроки с помощью split и удаляю последний элемент
# вывожу результат с методом title

my_list = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
for i in my_list:
    indx = my_list.index(i)
    obj = my_list[indx]
    obj_split = obj.split(' ')
    out = obj_split.pop()
    print(f'Привет, {out.title()}')

