# A. Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде
# <r> руб <kk> коп (например «5 руб 04 коп»). Подумать, как из цены получить рубли и копейки,
# как добавить нули, если, например, получилось 7 копеек или 0 копеек (должно быть 07 коп
# или 00 коп).
# B. Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что
# объект списка после сортировки остался тот же).


prices = [157.82, 463.51, 9, 5, 55, 66, 77.71, 77.66, 22.44, 65.77, 234.66, 23424.41, 234.23, 23.66, 76.73, 34.23, 345]
print(id(prices))
prices.sort()
print(id(prices))
for i in prices:
    result_rub = int(i)
    result_kop = (i - result_rub) * 100
    print(f'{result_rub} руб  {result_kop:02.0f} коп', end=', ')